<template>
  <v-container>
    <v-card elevation="2">
      <v-card-title>История</v-card-title>
      <v-card-subtitle>Тут я расскажу про <v-icon color="green" dense>mdi-spotify</v-icon> Spotify Model. Как раз, прямо сейчас его слушаю.</v-card-subtitle>
      <v-card-text>
        <v-img alt="Spotify Logo" aspect-ratio="4"
               src="https://digitark.ee/wp-content/uploads/spotify-green.png"></v-img>
        <p><strong>Spotify</strong> на данный момент является ведущим стриминговым сервисом в мире, но помимо этого
          Spotify имеет по-моему мнению самую интересную методологию по расширению и формированию команд. Одноимённое
          название данная модель получила из-за названия сервиса, при разработке которого впервые применилась.</p>
        <q>Но Spotify ведь это не выполненный в очень далёком прошлом Agile-проект.</q>
        <p>И правильно! Ведь если его разрабатывают до сих пор, и он успешен - <strong>значит работает!</strong></p>
        <p>Предлагаю перед тем как разбираться, взглянуть на схему данной модели.</p>
        <v-row>
          <v-col class="text-center align-self-center" cols="6">
            <v-tooltip nudge-bottom="30" top>
              <template v-slot:activator="{ on, attrs }">
                <v-img v-bind="attrs"
                       v-on="on"
                       src="http://agilerussia.ru/wp-content/uploads/2012/12/Scaling_Agile_111-1024x605.jpg"></v-img>
              </template>
              <span>Модель Spotify</span>
            </v-tooltip>
          </v-col>
          <v-col class="text-center" cols="6">
            <v-tooltip nudge-bottom="30" top>
              <template v-slot:activator="{ on, attrs }">
                <v-img v-bind="attrs"
                       v-on="on"
                       src="https://www.visual-paradigm.com/servlet/editor-content/scrum/what-is-scrum-team/sites/7/2018/10/what-is-scrum-team.png"></v-img>
              </template>
              <span>Scrum Team</span>
            </v-tooltip>
          </v-col>
        </v-row>
        <h2>Отряды</h2>
        <p>
          <strong>Основная единица разработки в Spotify – это Отряд (Squad).</strong>
          <br>
          Отряд похож на Scrum команду, она создана так, чтобы было ощущение небольшого срартапа. Весь отряд сидит
          вместе. У них есть все навыки и инструменты для проектирования, разработки, тестирования и сдачи продукта.
          Они представляют собой самоорганизующуюся команду, и сами определяют, как им лучше работать. Одни используют
          спринты Scrum, другие используют Kanban, некоторые используют смесь этих подходов.
          <br>
          У каждого отряда есть долгосрочная миссия, такая как создание и улучшение Android клиента, создание радио
          Spotify, масштабирование серверной части, или создание платежных решений. Картинка ниже показывает, как разные
          отряды принимают ответственность за разные части пользовательского опыта взаимодействия.
          <br>
          Данный подход позволяет создать отряды, в которых есть специалисты разного профиля.
          <br>
          У каждого отряда на длительное время есть своя миссия и своя часть продукта, поэтому члены отряда
          действительно становятся экспертами в своей области. Например, как построить классное радио.
          <br>
          У большинства отрядов есть свое рабочее пространство, включающее письменные столы, гостиную и «личную»
          комнату. Почти все стены – это доски. Мы никогда не видели лучшего пространства для взаимодействия!
        </p>
        <p>Чтобы помочь в этом, мы запустили процедуру ежеквартального исследования для каждого отряда. Так мы сможем
          сконцентрировать наши усилия и понять, какая организационная поддержка нужна. Вот как выглядит такое
          исследование, для пяти отрядов в клане:</p>
        <v-col class="d-flex justify-center" cols="12">
          <v-img max-width="50%" src="http://agilerussia.ru/wp-content/uploads/2012/12/Scaling_Agile_61.jpg"></v-img>
        </v-col>
        <h3>Стимулирование команды</h3>
        <p>
          Чтобы стимулировать обучение и инновации, отряды поощряют к тому, чтобы примерно 10% времени отводилось на
          «хакерские дни». Во время «хакерских дней» люди делают что им хочется, обычно они проверяют новые идеи и обмен
          мнениями со своими товарищами. У некоторых команд – один хакерский день каждую вторую неделю, другие собирают
          свои дни в «хакерскую неделю».
          <br>
          Хакерские дни – это не только прекрасное времяпровождение, это также отличный способ узнавать о современных
          инструментах и практиках, а иногда это ведет к важным инновациям в продукте!
          <br>
          У отряда нет формально назначенного лидера, но есть product owner. Product owner отвечает за приоритезацию
          работ команды, но он не вовлекается в то, как выполняется сама работа. Product owner-ы разных отрядов
          взаимодействуют друг с другом, чтобы поддерживать высокоуровневый документ, который показывает, куда же
          движется Spotify как единое целое. И каждый product owner отвечает за поддержку баклога продукта для своего
          отряда.
          <br>
          У каждой команды есть Agile Coach.
        </p>
        <v-divider class="ma-2"/>
        <h2>Кланы</h2>
        <p>
          <strong>Клан (Tribe) – это набор отрядов , которые работают во взаимосвязанных областях, таких как плеер или
            инфраструктура бэкэнда.</strong>
          <br>
          Клан можно представить как “инкубатор” для мини-стартапов-отрядов, у них большая степень свободы и автономии.
          У каждого клана есть лидер, который отвечает за создание наилучших условий существования отрядов внутри клана.
          Отряды клана физически находятся в одном офисе, рядом друг с другом, и расположенные рядом гостиные
          способствуют общению между отрядами.
        </p>
        <v-col class="d-flex justify-center" cols="12">
          <v-img max-width="50%" src="http://agilerussia.ru/wp-content/uploads/2012/12/Scaling_Agile_112.jpg"></v-img>
        </v-col>
        <v-divider class="ma-2"/>
        <h2>Отделы и гильдии</h2>
        <p>Отдел – это маленькая семья людей со сходными навыками, работающих в одной сфере компетенции, внутри клана.
          <br>
          Каждый отдел регулярно встречается, чтобы обсуждать их область экспертизы и их специфические проблемы.
          Например, отдел тестировщиков или отдел web разработчиков.
          <br>
          Гильдия – это более органичное и более масштабное «сообщество по интересам», группа людей, которые хотят
          поделиться знаниями, инструментами, кодом и практиками. Отделы всегда внутри клана, а гильдия охватывает
          специалистов всей организации. Вот некоторые примеры: гильдия web технологий, гильдия тестирования, гильдия
          agile коучей, и т.д.
          <br>
          Часто гильдия включает все отделы, работающие в этой области. Например, гильдия тестирования включает всех
          тестировщиков из всех отделов тестирования, но вообще говоря присоединиться к гильдии может любой
          заинтересованный.
        </p>
        <v-col class="d-flex justify-center" cols="12">
          <v-img max-width="70%" src="http://agilerussia.ru/wp-content/uploads/2012/12/Scaling_Agile_151.jpg"></v-img>
        </v-col>
        <v-divider class="ma-2"/>
        <h2>Как это работает?</h2>
        <p>Компания Spotify выросла очень быстро – более чем за 3 года мы выросли с 30 до 250 человек.
          <br>
          Эта модель
          масштабирования – с отрядами, кланами, отделами и гильдиями – была постепенно введена в течение последнего
          года, поэтому люди все еще привыкают к ней. Но, судя по опросам и ретроспективам, эта модель масштабирования
          работает достаточно хорошо!
          <br> Несмотря на быстрый рост, удовлетворенность сотрудников постоянно растет: в апреле 2012 она составляла
          4.4 из 5 возможных.
        </p>
      </v-card-text>
      <v-card-actions>
        <v-col cols="6">
          <v-btn block text @click.stop="scrollToTop">
            <v-icon left>mdi-arrow-up</v-icon>
            Вернуться навверх
          </v-btn>
        </v-col>
        <v-col cols="6">
          <v-btn block text to="/">
            <v-icon left>mdi-home</v-icon>
            Вернуться на главную
          </v-btn>
        </v-col>
      </v-card-actions>
    </v-card>
  </v-container>
</template>

<script>
export default {
  name: "History",
  methods: {
    scrollToTop() {
      window.scroll({
        behavior: 'smooth',
        top: 0
      })
    }
  }
}
</script>

<style scoped>

</style>
