<template>
  <v-container>
    <v-card elevation="2">
      <v-row class="d-flex align-center">
        <v-col cols="6">
          <v-card-title>
            Принципы Agile
          </v-card-title>
        </v-col>
        <v-col cols="6" class="text-right">
          <v-btn icon class="mr-2" @click="collapseAll"><v-icon>mdi-arrow-collapse-vertical</v-icon></v-btn>
          <v-btn icon class="mr-2" @click="expandAll"><v-icon>mdi-arrow-expand-vertical</v-icon></v-btn>
        </v-col>
      </v-row>
      <v-card-text>
        <v-expansion-panels v-model="openPanels" multiple accordion>
          <v-expansion-panel v-for="(principle, i) in principles" :key="i" :principe="principle">
            <v-expansion-panel-header><strong>{{
                principle
              }}</strong>
            </v-expansion-panel-header>
            <v-expansion-panel-content>
              {{ opinion[i] }}
            </v-expansion-panel-content>
          </v-expansion-panel>
        </v-expansion-panels>
      </v-card-text>
    </v-card>
  </v-container>
</template>

<script>
export default {
  name: "Principles",
  data() {
    return {
      principles: [
        `Наивысшим приоритетом для нас является удовлетворение потребностей
заказчика, благодаря регулярной и ранней поставке ценного программного
обеспечения.`,
        `Изменение требований приветствуется, даже на поздних стадиях разработки.
Agile-процессы позволяют использовать изменения для обеспечения заказчику
конкурентного преимущества.`,
        `Работающий продукт следует выпускать как можно чаще, с периодичностью
от пары недель до пары месяцев.`,
        `На протяжении всего проекта разработчики и представители бизнеса должны
ежедневно работать вместе. `,
        `Над проектом должны работать мотивированные профессионалы. Чтобы
работа была сделана, создайте условия, обеспечьте поддержку и полностью
доверьтесь им.`,
        `Непосредственное общение является наиболее практичным и эффективным
способом обмена информацией как с самой командой, так и внутри команды.`,
        'Работающий продукт — основной показатель прогресса.',
        `Инвесторы, разработчики и пользователи должны иметь возможность
поддерживать постоянный ритм бесконечно. Agile помогает наладить такой
устойчивый процесс разработки.`,
        `Постоянное внимание к техническому совершенству и качеству
проектирования повышает гибкость проекта.`,
        'Простота — искусство минимизации лишней работы — крайне необходима.',
        `Самые лучшие требования, архитектурные и технические решения рождаются
у самоорганизующихся команд.`,
        `Команда должна систематически анализировать возможные способы
улучшения эффективности и соответственно корректировать
стиль своей работы.`
      ],
      opinion: [`Гибкая методология подразумевает быстрое внесение изменений в соответствии с потребностями заказчика, в этом и есть самое главное её преимущество.
      Это достаточно часто может доставлять неприятности разработчику, но делает бизнес-процессы оптимизированными в короткий срок.`,
      `В нашем прогрессивном мире, требования бизнеса могут изменяться совершенно быстро. Разработчики должны также с этим считаться.`,
      `Помимо изменений должны также часто делаться релизы, а именно выполняться требования заказчика.
      Для этого часто используется Scrum со спринтами, на которой ставится конкретная цель.
      Обычно после каждого спринта выпускается релиз, в котором отражаются выполненные цели спринта.`,
      `Agile Team и Stakeholders должны регулярно подчищать и следить за порядком Backlog Items.
      Данный подход упращает жизнь как разработчикам, так и представителям бизнеса.`,
      `Данная практика достаточно часто усугубляет и так достаточно серьёзный конкурс на рабочее место:
      предложение > спрос, но делает продукт максимально качественным. Достаточно много вещей в Agile требуют
      равные знания всей команды. Тот же самый Agile Poker для расчёта Estimated Effort невозможен, если у разработчиков
      нет равных знаний в технологии или области, которая оценивается. Таким образом, в Agile Team достаточно часто
      становится решающим фактором выбор тех разработчиков, которые имеют хотя бы минимальных опыт в других технологиях
      помимо своей основной специализации. В Agile Team гораздо проще взять на работу Front-End разработчика, который
      хотя бы касался Back-End стэка, в отличие от человека, который помимо JavaScript ничего не видел. В этих реалиях,
      на рынке труда достаточно часто мы видем вакансии FE с требованиями вроде: Vue.js, React, Angular, Kotlin, Golang.`,
      `Любые неточности должны обговариться как в команде, так и за её пределами. Любые неточности могут привести
      к лишним затратам на человекочасы в будущем, а это достаточно негативно сказывается на расходах как бизнеса,
      так и временных ресурсах команды разработки. Agile требует постоянной коммуникации между членами команды. Поэтому
      достаточно часто проводятся мероприятия вроде Sprint Review, Grooming, Planning, Retro. Мнение каждого члена
      команды и представителя бизнеса очень серьёзно влияет на качество конечного продукта.`,
      `И нет, не таски, не Burndown диаграмма и даже не Backlog Items. Без работающего продукта - все остальные вещи
      не имеют никакого значения. Работающий продукт стоит на первом месте, а всё вышеперечисленное это всего лишь то,
      что помогает реализовать эту цель.`,
      `Ничего не должно останавливаться. Не работающий продукт, не разработка и даже общение со всеми членами Agile Team.
      У продукта не должно быть стадии, когда делать нечего. Данная вещь говорит больше о том, что каждый член
      команды должен вносить свой вклад с заделом на будущее.`,
      `Люди знакомые с технической литературой наверняка знают, кто это написал. И плевать, что следующий принцип
      полностью противоречит этому. Написание гибкопроектируемых систем и чистого кода это очень важная вещь.
      Мы чаще читаем код, чем пишем. Системы спроектированные нерасширяемо не имеют никакого смысла, ибо у них
      нет никакого будущего. Даже если это open-source проект есть шанс, что когда-нибудь кто-нибудь его решит
      доработать в связи с изменившимся требованиями.`,
      `Есть смысл писать некоторые вещи заранее, зная, что в них может появиться необходимость в будущем.
      Простой код гораздо легче читать, писать и понимать. Называть переменные надо просто, проектировать системы
      надо просто. Ваша система не имеет никакого смысла, если кроме вас никто не понимает как оно работает.
      Следует понимать, что вашим продуктом будет пользоваться человек, который его не писал. Простые решения достаточно
      просто получается документировать и поддерживать. А если вы делаете что-то больше трёх раз, то стоит задуматься.`,
      `В данном пункте говориться о том, что команды должны быть кроссфункциональны и самоорганизуемы. Процессы
      не должны останавливаться из-за отсутствия какого-то человека в данный момент. Важна ответственность каждого
      из членов команды. В данной команде обычно нет Project Manager, а команда сама решает чем ей заниматься в данный момент.
      В этом правиле есть небольшие рамки, которые связаны с очередью Backlog Items, но в целом некоторые изменения
      не наносят особого ущерба. Состав команды всегда должен быть высоко замотивированный и быть сформирован окончательно.
      В команде должно присутствовать неформальное общение.`,
      `Нам всегда приходится иметь дело с чем-то новым, и не страшно, если у нас что-то не получается с первого раза.
      Команда, которая работает по адаптивным подходам, регулярно совершенствуется и учится работать лучше. Поэтому
      так важно фиксировать свои ошибки, рефлексировать и вводить новые правила для работы над похожими ситуациями в будущем.
      Важные моменты должны документироваться для избежания недоразумений в будущем. Анализ эффективности работы
      позволяет внести быстрые изменения в её порядок и повысить скорость выхода работающего продукта.`],
      openPanels: []
    }
  },
  methods: {
    expandAll() {
      this.openPanels = [...this.principles.keys()];
    },
    collapseAll() {
      this.openPanels = [];
    }
  }
}
</script>

<style scoped>

</style>
